{
  "news": [
    {
      "source": {
        "id": null,
        "name": "Ndtv.com"
      },
      "author": null,
      "title": "Watch: Pervez Musharraf Says \"Osama bin Laden Was Pakistan's Hero\" - NDTV News",
      "description": "Former Pakistan President Pervez Musharraf in an interview admitted that Kashmiris were \"trained in Pakistan\" as Mujahideen to fight against the Indian Army in Jammu and Kashmir. He also called jihadi terrorists as Pakistan's \"heroes\". He also said that terro…",
      "url": "https://i.ndtvimg.com/i/2016-04/musharraf_650x400_71460209701.jpg",
      "urlToImage": "https://i.ndtvimg.com/i/2016-04/musharraf_650x400_71460209701.jpg",
      "publishedAt": "2019-11-14T05:49:00Z",
      "content": "Former Pak President Pervez Musharraf also admitted to training terrorists to be used against IndiaIslamabad: Former Pakistan President Pervez Musharraf in an interview admitted that Kashmiris were \"trained in Pakistan\" as Mujahideen to fight against the Indi… [+2081 chars]",
      "id": 1
    },
    {
      "source": {
        "id": "the-times-of-india",
        "name": "The Times of India"
      },
      "author": "TIMESOFINDIA.COM",
      "title": "Anti-gravity exercise for diabetics: What it is and how to do it - Times of India",
      "description": "Sugar drops when you go against gravity. Let us take a deeper look at the importance of anti-gravity exercise for d",
      "url": "https://static.toiimg.com/photo/msid-72050235/72050235.jpg?688123",
      "urlToImage": "https://static.toiimg.com/photo/msid-72050235/72050235.jpg?688123",
      "publishedAt": "2019-11-14T05:30:00Z",
      "content": "When diabetics were questioned about the kind of exercise regime they follow, almost 60% of them answered walking. And this is a common belief not only in our country but worldwide. Diabetics are often recommended to walk for a minimum of 45 minutes and pract… [+3998 chars]",
      "id": 2
    },
    {
      "url": "https://c.ndtvimg.com/2021-04/mkkpukco_pm-modi-pti_625x300_21_April_21.jpg",
      "author": "NDTV News",
      "title": "As PM Modi Urges \"Lockdowns Only As Last Resort\", What Economists Say - NDTV",
      "description": "Prime Minister Narendra Modi, who last year imposed a strict lockdown on short notice, asked states to avoid shutting businesses as India grapples with a new wave of Covid-19 infections that threatens a nascent economic revival.",
      "id": 3
    },
    {
      "url": "https://images.hindustantimes.com/img/2021/04/21/1600x900/ajeeb_1618980751525_1618980766111.jpg",
      "author": "Hindustan Times",
      "title": "Aditi Rao Hydari, Fatima Sana Shaikh, Nushrratt Bharuccha respond to bizarre DMs on Covid-19 vaccine, 'short clothes' - Hindustan Times",
      "description": "In a new video, Ajeeb Daastaans stars Aditi Rao Hydari, Fatima Sana Shaikh and Nushrratt Bharuccha fielded bizarre messages they received from fans.",
      "id": 4
    },
    {
      "url": "https://c.ndtvimg.com/2021-04/1huab1ro_mumbai-indians-bcciipl_625x300_21_April_21.jpg",
      "author": "NDTV News",
      "title": "IPL 2021, DC vs MI: Rohit Sharma Fined Rs 12 Lakh For Mumbai Indians' Slow Over-Rate - NDTVSports.com",
      "description": "IPL 2021: Mumbai Indians skipper Rohit Sharma was fined Rs 12 lakh after the team maintained slow over-rate during Tuesday's clash against Delhi Capitals in Chennai.",
      "id": 5
    },
    {
      "url": "https://fdn.gsmarena.com/imgroot/news/21/04/realme-8-5g-announced/-476x249w4/gsmarena_000.jpg",
      "author": "GSMArena.com",
      "title": "Realme 8 5G arrives with Dimensity 700 chip and 90Hz LCD - GSMArena.com news - GSMArena.com",
      "description": "The main attraction here compared to the Realme 8 (4G) is the next-gen connectivity. But the Realme 7 5G might be a problem.",
      "id": 6
    },
    {
      "url": "https://static.toiimg.com/thumb/msid-82194878,width-1070,height-580,imgsize-280968,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "author": "The Times of India",
      "title": "SC takes suo moto cognisance of Covid-19 situation, issues notice to Centre",
      "description": "India News: SC says hearing by six different HCs on COVID-19 related issues may create some kind of confusion. A bench headed by Chief S A Bobde said it would als",
      "id": 7
    },
    {
      "url": "https://c.ndtvimg.com/2021-04/1o144qs_rahul-bcci-ipl_625x300_23_April_21.jpg",
      "author": "NDTV News",
      "title": "PBKS vs MI IPL 2021 Live Score: Rohit Sharma Fifty Boosts Mumbai Indians After Slow Start - NDTV Sports",
      "description": "PBKS vs MI IPL Live Score 2021, Punjab Kings vs Mumbai Indians: Defending a target of 132 runs, Rahul Chahar has taken a wicket for Rohit Sharma's side in Match 17 of IPL 2021, at the MA Chidambaram Stadium.",
      "id": 8
    }
  ]
}
